<?php
// c for constant

// 性别
$c_sex = array(1=>"男",2=>"女");

// 民族
$c_nation = array(1=>"汉族",2=>"蒙古族",3=>"回族",4=>"藏族",5=>"维吾尔族",6=>"苗族",7=>"彝族",8=>"壮族",9=>"布依族",10=>"朝鲜族",
				11=>"满族",12=>"侗族",13=>"瑶族",14=>"白族",15=>"土家族",16=>"哈尼族",17=>"哈萨克族",18=>"傣族",19=>"黎族",
				20=>"傈僳族",21=>"佤族",22=>"畲族",23=>"高山族",24=>"拉祜族",25=>"水族",26=>"东乡族",27=>"纳西族",28=>"景颇族",
				29=>"柯尔克孜族",30=>"土族",31=>"达斡尔族",32=>"仫佬族",33=>"羌族",34=>"布朗族",35=>"撒拉族",36=>"毛南族",
				37=>"仡佬族",38=>"锡伯族",39=>"阿昌族",40=>"普米族",41=>"塔吉克族",42=>"怒族",43=>"乌孜别克族",44=>"俄罗斯族",
				45=>"鄂温克族",46=>"德昂族",47=>"保安族",48=>"裕固族",49=>"京族",50=>"塔塔尔族",51=>"独龙族",52=>"鄂伦春族",
				53=>"赫哲族",54=>"门巴族",55=>"珞巴族",56=>"基诺族");

// 婚姻状况
$c_marriage = array(1=>"未婚",2=>"已婚",3=>"丧偶",4=>"离婚",9=>"其他");

// 户籍地址类型 or 户口类型
$c_hukouAddressType = array(10=>"本市城镇",11=>"省内城镇",12=>"外省城镇",21=>"省内农村",23=>"外省农村");

// 文化程度 or 教育程度
$c_education = array(11=>"博士",12=>"硕士",21=>"大学",31=>"大专",40=>"中专中技",50=>"技校",61=>"高中",
					62=>"职高",63=>"职专",70=>"初中",80=>"小学",90=>"文盲或半文盲",99=>"其他");
					
// 职称
$c_title = array(1=>"初级",2=>"中级",3=>"高级",9=>"其他");

// 政治面貌
$c_politics = array(1=>"党员",2=>"团员",3=>"民主人士",4=>"群众",9=>"其他");

// 就业类型
$c_employmentType = array(1=>"深户人员初次就业",2=>"深户人员流动就业",3=>"深户人员失业转就业",4=>"非深户人口初次就业",
							5=>"非深户人口流动就业",6=>"军转干部",7=>"复退人员",8=>"内地派进工作人员",9=>"劳务派遣人员",
							10=>"市外调入",11=>"市外招用");
							
// 职业技能等级 
$c_skillLevel = array(1=>"高级技师",2=>"技师",3=>"高级技术等级",4=>"中级技术等级",5=>"初级技术等级",9=>"无");

// 住所类别
$c_houseType = array(1=>"旅店",2=>"居民家中",3=>"单位内部",4=>"工地现场",5=>"租赁房屋",6=>"自购房",9=>"其他");

// 居住方式
$c_residentialType = array(1=>"单身居住",2=>"家庭居住",3=>"合伙居住",4=>"集体居住",9=>"其它");

// 广东省流动人口避孕节育情况报告单
$c_planBirthReport = array(0=>"无",1=>"有");

// 来深居住事由
$c_comereason = array(1=>"务工",2=>"务农",3=>"经商",4=>"服务",5=>"因公出差",6=>"借读培训",
						7=>"治病疗养",8=>"保姆",9=>"投靠亲友",10=>"探亲访友",11=>"旅游观光",12=>"其他");
						
// 办理就业登记的同时是否办理居住证
$c_firstApp = array(1=>"是",0=>"否");

// 状态
$c_status = array(0=>"全部",2=>"办理中",3=>"已申报",4=>"已办好");

?>